
[AdventCryoPriestM2 X2CharacterTemplate]
strCharacterName="Advanced Cryo Priest"
strAcquiredText="Armed with a Frost Grenade and an Icethrower weapon, these Cryo Priests will try to disable superior opponents in the field." 
[AdventCryoPriestM3 X2CharacterTemplate]
strCharacterName="Elite Cryo Priest"
strAcquiredText="Armed with a Frost Grenade and an Icethrower weapon, these Cryo Priests will try to disable superior opponents in the field." 
